Autodesk.Revit.DB.HostedSweep.AddSegment(Autodesk.Revit.DB.Reference)
Add segments to the hosted sweep object.

Autodesk.Revit.DB.HostedSweep.GetEndPointParameter(Autodesk.Revit.DB.Reference,System.Int32)
Retrieve segment's start point or end point parameter.
targetRef: Segment's reference whose parameter want to be get.
endIdx: Start point (=0) or end point (=1).
Returns: Start point or end point parameter.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when regeneration fails.

Autodesk.Revit.DB.HostedSweep.SetEndPointParameter(Autodesk.Revit.DB.Reference,System.Int32,System.Double)
Set segment's start point or end point parameter.
targetRef: Segment's reference whose parameter want to be set.
endIdx: Start point (=0) or end point (=1).
param: Value of parameter.
Returns: true if operation success.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when regeneration fails.

Autodesk.Revit.DB.HostedSweep.RemoveSegment(Autodesk.Revit.DB.Reference)
Remove segments from the  hosted sweep object.
targetRef: Segment's reference which want to be removed.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when regeneration fails.

Autodesk.Revit.DB.HostedSweep.VerticalFlip
Flip the hosted sweep object along vertical line.

Autodesk.Revit.DB.HostedSweep.HorizontalFlip
Flip the hosted sweep object along horizontal line.

Autodesk.Revit.DB.HostedSweep.ReferenceCurve(Autodesk.Revit.DB.Reference)
The curve on which the hosted sweep segment is created.
targetRef: Reference of the curve that hosts the object.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when regeneration fails.

Autodesk.Revit.DB.HostedSweep.VerticalFlipped
Retrieve the vertical flip status of the hosted sweep object.

Autodesk.Revit.DB.HostedSweep.HorizontalFlipped
Retrieve the horizontal flip status of the hosted sweep object.

Autodesk.Revit.DB.HostedSweep.Angle
Retrieve/set the angle of the  hosted sweep object relative its references (Unit : Radian).

Autodesk.Revit.DB.HostedSweep.VerticalOffset
Retrieve/set the vertical offset of the hosted sweep object.

Autodesk.Revit.DB.HostedSweep.HorizontalOffset
Retrieve/set the horizontal offset of the hosted sweep object.

Autodesk.Revit.DB.HostedSweep.Length
Retrieve the length of the hosted sweep object.

Autodesk.Revit.DB.HostedSweep
An object that represents an object hosted by an edge of a roof or floor within the Autodesk Revit project.